<a href="https://colab.research.google.com/github/jiangenhe/insc-486-2021-spring/blob/main/assignment2/Solution_Assignment_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# INSC 486 - Assignment 2

- Due: Feburary 26, Friday, 11:59 pm
- Submit your Colab link or ipynb file through Canvas
- This assignment is worth 100 points that accounts for 10% of your final grade.
- All the datasets are available on Canvas.
- **Code efficiency will be considered in grading.**

Learning Objectives:
- Clean data
- Combine and merge datasets
- String manipulation
- Practice your pandas skills

## Part 1 Auto MPG Data (30%)
The following exercise utilizes data from UC Irvine Machine Learning Repository. You can learn more about the dataset by [the link](https://archive.ics.uci.edu/ml/datasets/Auto+MPG).

### Step 1. Import the pandas and NumPy libraries

In [ ]:
import numpy as np
import pandas as pd

### Step 2. Import dataset cars1.csv to DataFrame cars1
You can load the dataset by the following URL without downloading the data.

https://raw.githubusercontent.com/jiangenhe/insc-486-2021-spring/main/assignment2/cars2.csv

pandas.read_csv can csv from any valid string path. The string could be a URL. Valid URL schemes include http, ftp, s3, gs, and file. For file URLs, a host is expected.

In [ ]:

car1 = pd.read_csv("https://raw.githubusercontent.com/jiangenhe/insc-486-2021-spring/main/assignment2/cars1.csv")
car1.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu,NaN,NaN,NaN,NaN,NaN
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320,NaN,NaN,NaN,NaN,NaN
2,18.0,8.0,318.0,150,3436,11.0,70,1,plymouth satellite,NaN,NaN,NaN,NaN,NaN
3,16.0,8.0,304.0,150,3433,12.0,70,1,amc rebel sst,NaN,NaN,NaN,NaN,NaN
4,17.0,8.0,302.0,140,3449,10.5,70,1,ford torino,NaN,NaN,NaN,NaN,NaN

### Step 3. car1 dataset has some unnamed blank columns. Fix cars1 dataset by removing these blank columns.

In [ ]:
car1.dropna(how='all', axis=1).shape

(198, 9)

In [ ]:
car1 = car1.loc[:, 'mpg':'car']

   ### Step 4. Supposing clyinder is critical information in your analysis, so you need to remove rows where cylinder column is NaN

In [ ]:
car1.dropna(subset=['cylinders'], inplace=True)

### Step 5. Use the mean of displacement to fill NaN in displayment column.

In [ ]:
car1['displacement'].fillna(car1['displacement'].mean(), inplace=True)

### Step 6. Join cars1 and cars2 into a single DataFrame called cars

cars2: https://raw.githubusercontent.com/jiangenhe/insc-486-2021-spring/main/assignment2/cars2.csv

In [ ]:
car2 = pd.read_csv("https://raw.githubusercontent.com/jiangenhe/insc-486-2021-spring/main/assignment2/cars2.csv")

In [ ]:
car = car1.append(car2)
car.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8.0,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8.0,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8.0,302.0,140,3449,10.5,70,1,ford torino

### Step 7. What is the number of observations in each dataset?

In [ ]:
len(car)

395

In [ ]:
car.shape[0]

395

## Part 2 Merge datasets (25%)

### Step 1. Import pandas

### Step 2. Create the 3 DataFrames based on the following raw data and assign each to a variable called data1, data2, data3

In [ ]:
raw_data_1 = {
        'subject_id': ['1', '2', '3', '4', '5'],
        'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'], 
        'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']}

raw_data_2 = {
        'subject_id': ['4', '5', '6', '7', '8'],
        'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 
        'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}

raw_data_3 = {
        'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}

data1=pd.DataFrame(raw_data_1)
data2=pd.DataFrame(raw_data_2)
data3=pd.DataFrame(raw_data_3)

### Step 3. Concatenate the two dataframes along rows and assign to varialbe called all

In [ ]:
all = pd.concat([data1, data2])
all

  first_name last_name subject_id
0       Alex  Anderson          1
1        Amy  Ackerman          2
2      Allen       Ali          3
3      Alice      Aoni          4
4     Ayoung   Atiches          5
0      Billy    Bonder          4
1      Brian     Black          5
2       Bran   Balwner          6
3      Bryce     Brice          7
4      Betty    Btisan          8

### Step 4. Concatenate the two dataframes along columns and assign to variable called all_col

In [ ]:
all_col = pd.concat([data1, data2], axis=1)

  first_name last_name subject_id first_name last_name subject_id
0       Alex  Anderson          1      Billy    Bonder          4
1        Amy  Ackerman          2      Brian     Black          5
2      Allen       Ali          3       Bran   Balwner          6
3      Alice      Aoni          4      Bryce     Brice          7
4     Ayoung   Atiches          5      Betty    Btisan          8

### Step 5. Merge all and data3 along the subject_id value

In [ ]:
pd.merge(all, data3, on='subject_id', how='left')

  first_name last_name subject_id  test_id
0       Alex  Anderson          1     51.0
1        Amy  Ackerman          2     15.0
2      Allen       Ali          3     15.0
3      Alice      Aoni          4     61.0
4     Ayoung   Atiches          5     16.0
5      Billy    Bonder          4     61.0
6      Brian     Black          5     16.0
7       Bran   Balwner          6      NaN
8      Bryce     Brice          7     14.0
9      Betty    Btisan          8     15.0

### Step 6. Merge only the data that has the same 'subject_id' on both data1 and data2

In [ ]:
pd.merge(data1, data2, how='inner', on='subject_id')

### Step 7. Merge all values in data1 and data2, with matching records from both sides where available.

In [ ]:
pd.merge(data1, data2, how='outer', on='subject_id')

## Part 3 Chipotle (45%)



### Step 1. Import pandas

In [3]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this link: https://raw.githubusercontent.com/jiangenhe/insc-486-2021-spring/main/assignment2/chipotle.tsv, and assign it to a variable called chipotle.

In [4]:
df = pd.read_csv("https://raw.githubusercontent.com/jiangenhe/insc-486-2021-spring/main/assignment2/chipotle.tsv", sep='\t')
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

### Step 3. How many products cost more than ten dolloars? (6%)
(Use item_name and choice_description to define a product)

In [5]:
df['item_price'] = df['item_price'].str.replace("$", "").astype(float)
df['unit_price'] = df['item_price']/df['quantity']

In [6]:
product_cost = df.groupby(['item_name', 'choice_description'])['unit_price'].apply(np.mean)
len(product_cost[product_cost > 10])

707

### Step 4. Sort by the name of the item (3%)

In [8]:
df.sort_values('item_name', inplace=True)

### Step 5. What was the quantity of the most expensive item ordered? (3%)

In [9]:
product_cost.idxmax()

('Barbacoa Salad Bowl', '[Fresh Tomato Salsa, Guacamole]')

In [10]:

df[(df['item_name'] == 'Barbacoa Salad Bowl') & (df['choice_description'] == '[Fresh Tomato Salsa, Guacamole]')]['quantity'].sum()

1

### Step 6. How many times was a Veggie Soft Tacos ordered? (3%)

In [11]:
df[(df['item_name'] == 'Veggie Soft Tacos')]['quantity'].sum()

8

### Step 7. How many times did someone order more than one Canned Soda? (3%)

In [12]:
df[(df['item_name'] == 'Canned Soda') & (df['quantity'] > 1)].count()

order_id              20
quantity              20
item_name             20
choice_description    20
item_price            20
unit_price            20
dtype: int64

### Step 8. Create a coloumn for Salsa and remove salsa from choice_description. Which Salsa is the most popular one? (6%)

In [13]:
salsa_df = df.dropna(subset=['choice_description'])
salsa_df = salsa_df[salsa_df['choice_description'].str.contains("Salsa")]

In [14]:
salsa_df.head()

,order_id,quantity,item_name,choice_description,item_price,unit_price
418,182,1,Barbacoa Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",9.25,9.25
2253,907,1,Barbacoa Bowl,"[Fresh Tomato Salsa, [Rice, Fajita Vegetables,...",9.25,9.25
4485,1786,1,Barbacoa Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",11.75,11.75
1032,425,1,Barbacoa Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",9.25,9.25
3017,1200,1,Barbacoa Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",11.75,11.75

In [15]:
salsa_df['choice_description1'] = salsa_df['choice_description'].str.replace(r'\[|\]', '').str.split(',')
salsa_df['choice_description1'].head()

418     [Fresh Tomato Salsa,  Fajita Vegetables,  Rice...
2253    [Fresh Tomato Salsa,  Rice,  Fajita Vegetables...
4485    [Fresh Tomato Salsa,  Fajita Vegetables,  Rice...
1032    [Fresh Tomato Salsa,  Fajita Vegetables,  Rice...
3017    [Fresh Tomato Salsa,  Fajita Vegetables,  Rice...
Name: choice_description1, dtype: object

In [18]:
# turn the series to a list and then reconstruct a datafrem from the list

non_salsa_choices = pd.DataFrame(salsa_df['choice_description1'].map(lambda x: [i for i in x if 'Salsa' not in i]).to_list(), index=salsa_df.index)
non_salsa_choices.head()

,0,1,2,3,4,5,6,7
418,Fajita Vegetables,Rice,Black Beans,Cheese,None,None,None,None
2253,Rice,Fajita Vegetables,Black Beans,Sour Cream,None,None,None,None
4485,Fajita Vegetables,Rice,Black Beans,Guacamole,Lettuce,None,None,None
1032,Fajita Vegetables,Rice,Cheese,Sour Cream,None,None,None,None
3017,Fajita Vegetables,Rice,Black Beans,Cheese,Guacamole,Lettuce,None,None

In [22]:
# stack the dataframe to a series
# remove index at the second level
non_salsa_choices = non_salsa_choices.stack().reset_index(level=1, drop=True).str.strip()
non_salsa_choices.head()

418     Fajita Vegetables
418                  Rice
418           Black Beans
418                Cheese
2253                 Rice
dtype: object

In [23]:
non_salsa_choices.name = 'non_salsa'

In [29]:
salsa_choices = pd.DataFrame(salsa_df['choice_description1'].map(lambda x: [i for i in x if 'Salsa' in i]).to_list(), index=salsa_df.index).stack().reset_index(level=1, drop=True).str.strip()
salsa_choices.name = 'salsa'
salsa_choices.head()

418     Fresh Tomato Salsa
2253    Fresh Tomato Salsa
4485    Fresh Tomato Salsa
1032    Fresh Tomato Salsa
3017    Fresh Tomato Salsa
Name: salsa, dtype: object

In [33]:
# merge salsa and non_salsa by their index
m = pd.merge(salsa_choices, non_salsa_choices, left_index=True, right_index=True )
# merge columns from original dataframe
m_quantity = pd.merge(m, salsa_df[['quantity','item_name']], left_index=True, right_index=True)
m_quantity.head()

                             salsa    non_salsa  quantity     item_name
4  Tomatillo-Red Chili Salsa (Hot)  Black Beans         2  Chicken Bowl
4  Tomatillo-Red Chili Salsa (Hot)         Rice         2  Chicken Bowl
4  Tomatillo-Red Chili Salsa (Hot)       Cheese         2  Chicken Bowl
4  Tomatillo-Red Chili Salsa (Hot)   Sour Cream         2  Chicken Bowl
5        Fresh Tomato Salsa (Mild)         Rice         1  Chicken Bowl

### Step 9. For each Salsa, list ten most ordered item with the Salsa (6%)

In [55]:
# Group by salsa and item_name first
# Regroup by salsa
# sort within each group and obtain top 10
m_quantity.groupby(['salsa', 'item_name'])['quantity'].sum().reset_index(level=1).groupby('salsa').apply(lambda x: x.sort_values(by='quantity',ascending=False).head(10))

                                                                                      item_name  \
salsa                                salsa
Fresh Tomato Salsa                   Fresh Tomato Salsa                            Chicken Bowl
                                     Fresh Tomato Salsa                         Chicken Burrito
                                     Fresh Tomato Salsa                           Steak Burrito
                                     Fresh Tomato Salsa                              Steak Bowl
                                     Fresh Tomato Salsa                      Chicken Salad Bowl
                                     Fresh Tomato Salsa                             Veggie Bowl
                                     Fresh Tomato Salsa                          Veggie Burrito
                                     Fresh Tomato Salsa                           Carnitas Bowl
                                     Fresh Tomato Salsa                        Carnitas Burrito
                                     Fresh Tomato Salsa                      Chicken Soft Tacos
Fresh Tomato Salsa (Mild)            Fresh Tomato Salsa (Mild)                     Chicken Bowl
                                     Fresh Tomato Salsa (Mild)                  Chicken Burrito
                                     Fresh Tomato Salsa (Mild)                    Steak Burrito
                                     Fresh Tomato Salsa (Mild)                   Veggie Burrito
                                     Fresh Tomato Salsa (Mild)                       Steak Bowl
                                     Fresh Tomato Salsa (Mild)               Chicken Soft Tacos
                                     Fresh Tomato Salsa (Mild)                      Veggie Bowl
                                     Fresh Tomato Salsa (Mild)                    Carnitas Bowl
                                     Fresh Tomato Salsa (Mild)                 Carnitas Burrito
                                     Fresh Tomato Salsa (Mild)             Chicken Crispy Tacos
Roasted Chili Corn Salsa             Roasted Chili Corn Salsa                      Chicken Bowl
                                     Roasted Chili Corn Salsa                   Chicken Burrito
                                     Roasted Chili Corn Salsa                     Steak Burrito
                                     Roasted Chili Corn Salsa                        Steak Bowl
                                     Roasted Chili Corn Salsa                       Veggie Bowl
                                     Roasted Chili Corn Salsa                Chicken Soft Tacos
                                     Roasted Chili Corn Salsa                  Barbacoa Burrito
                                     Roasted Chili Corn Salsa                     Carnitas Bowl
                                     Roasted Chili Corn Salsa                Chicken Salad Bowl
                                     Roasted Chili Corn Salsa              Chicken Crispy Tacos
...                                                                                         ...
Tomatillo Red Chili Salsa            Tomatillo Red Chili Salsa                  Chicken Burrito
                                     Tomatillo Red Chili Salsa                     Chicken Bowl
                                     Tomatillo Red Chili Salsa                    Steak Burrito
                                     Tomatillo Red Chili Salsa                       Steak Bowl
                                     Tomatillo Red Chili Salsa                 Barbacoa Burrito
                                     Tomatillo Red Chili Salsa                    Barbacoa Bowl
                                     Tomatillo Red Chili Salsa                      Veggie Bowl
                                     Tomatillo Red Chili Salsa                   Veggie Burrito
                                     Tomatillo Red Chili Salsa              Barbacoa Soft Tacos
                                     Tomatillo Red Chili Salsa              Carnitas Soft Tacos
Tomatillo-Green Chili Salsa (Medium) Tomatillo-Green Chili Salsa (Medium)       Chicken Burrito
                                     Tomatillo-Green Chili Salsa (Medium)          Chicken Bowl
                                     Tomatillo-Green Chili Salsa (Medium)         Steak Burrito
                                     Tomatillo-Green Chili Salsa (Medium)            Steak Bowl
                                     Tomatillo-Green Chili Salsa (Medium)         Barbacoa Bowl
                                     Tomatillo-Green Chili Salsa (Medium)        Veggie Burrito
                                     Tomatillo-Green Chili Salsa (Medium)      Barbacoa Burrito
                                     Tomatillo-Green Chili Salsa (Medium)      Steak Soft Tacos
                                     Tomatillo-Green Chili Salsa (Medium)           Veggie Bowl
                                     Tomatillo-Green Chili Salsa (Medium)    Chicken Soft Tacos
Tomatillo-Red Chili Salsa (Hot)      Tomatillo-Red Chili Salsa (Hot)               Chicken Bowl
                                     Tomatillo-Red Chili Salsa (Hot)            Chicken Burrito
                                     Tomatillo-Red Chili Salsa (Hot)              Steak Burrito
                                     Tomatillo-Red Chili Salsa (Hot)                 Steak Bowl
                                     Tomatillo-Red Chili Salsa (Hot)              Carnitas Bowl
                                     Tomatillo-Red Chili Salsa (Hot)                Veggie Bowl
                                     Tomatillo-Red Chili Salsa (Hot)           Barbacoa Burrito
                                     Tomatillo-Red Chili Salsa (Hot)         Chicken Soft Tacos
                                     Tomatillo-Red Chili Salsa (Hot)             Veggie Burrito
                                     Tomatillo-Red Chili Salsa (Hot)           Steak Soft Tacos

                                                                           quantity
salsa                                salsa
Fresh Tomato Salsa                   Fresh Tomato Salsa                        1442
                                     Fresh Tomato Salsa                         961
                                     Fresh Tomato Salsa                         458
                                     Fresh Tomato Salsa                         326
                                     Fresh Tomato Salsa                         272
                                     Fresh Tomato Salsa                         157
                                     Fresh Tomato Salsa                         152
                                     Fresh Tomato Salsa                         124
                                     Fresh Tomato Salsa                         117
                                     Fresh Tomato Salsa                         103
Fresh Tomato Salsa (Mild)            Fresh Tomato Salsa (Mild)                  396
                                     Fresh Tomato Salsa (Mild)                  273
                                     Fresh Tomato Salsa (Mild)                  260
                                     Fresh Tomato Salsa (Mild)                  149
                                     Fresh Tomato Salsa (Mild)                  124
                                     Fresh Tomato Salsa (Mild)                   76
                                     Fresh Tomato Salsa (Mild)                   74
                                     Fresh Tomato Salsa (Mild)                   41
                                     Fresh Tomato Salsa (Mild)                   29
                                     Fresh Tomato Salsa (Mild)                   26
Roasted Chili Corn Salsa             Roasted Chili Corn Salsa                   502
                                     Roasted Chili Corn Salsa                   294
                                     Roasted Chili Corn Salsa                   239
                                     Roasted Chili Corn Salsa                   198
                                     Roasted Chili Corn Salsa                   113
                                     Roasted Chili Corn Salsa                    95
                                     Roasted Chili Corn Salsa                    93
                                     Roasted Chili Corn Salsa                    83
                                     Roasted Chili Corn Salsa                    76
                                     Roasted Chili Corn Salsa                    47
...                                                                             ...
Tomatillo Red Chili Salsa            Tomatillo Red Chili Salsa                  295
                                     Tomatillo Red Chili Salsa                  286
                                     Tomatillo Red Chili Salsa                  162
                                     Tomatillo Red Chili Salsa                  107
                                     Tomatillo Red Chili Salsa                   89
                                     Tomatillo Red Chili Salsa                   74
                                     Tomatillo Red Chili Salsa                   52
                                     Tomatillo Red Chili Salsa                   47
                                     Tomatillo Red Chili Salsa                   47
                                     Tomatillo Red Chili Salsa                   45
Tomatillo-Green Chili Salsa (Medium) Tomatillo-Green Chili Salsa (Medium)       161
                                     Tomatillo-Green Chili Salsa (Medium)       115
                                     Tomatillo-Green Chili Salsa (Medium)        83
                                     Tomatillo-Green Chili Salsa (Medium)        44
                                     Tomatillo-Green Chili Salsa (Medium)        30
                                     Tomatillo-Green Chili Salsa (Medium)        30
                                     Tomatillo-Green Chili Salsa (Medium)        30
                                     Tomatillo-Green Chili Salsa (Medium)        26
                                     Tomatillo-Green Chili Salsa (Medium)        22
                                     Tomatillo-Green Chili Salsa (Medium)        12
Tomatillo-Red Chili Salsa (Hot)      Tomatillo-Red Chili Salsa (Hot)            348
                                     Tomatillo-Red Chili Salsa (Hot)            226
                                     Tomatillo-Red Chili Salsa (Hot)            203
                                     Tomatillo-Red Chili Salsa (Hot)             91
                                     Tomatillo-Red Chili Salsa (Hot)             56
                                     Tomatillo-Red Chili Salsa (Hot)             38
                                     Tomatillo-Red Chili Salsa (Hot)             38
                                     Tomatillo-Red Chili Salsa (Hot)             36
                                     Tomatillo-Red Chili Salsa (Hot)             33
                                     Tomatillo-Red Chili Salsa (Hot)             28

[82 rows x 2 columns]

### Step 10. How many times Black Beans have been ordered? Which item is the most popular combination with Black Beans? Which choice is the most popular combination with Black Beans? (15%)

In [34]:
m_quantity[m_quantity['non_salsa'] == 'Black Beans'].groupby(['salsa','non_salsa'])['quantity'].sum().reset_index().max()

salsa        Tomatillo-Red Chili Salsa (Hot)
non_salsa                        Black Beans
quantity                                 517
dtype: object